docs/C-APIs-sequence-AF-actions.mmd
sequenceDiagram
autonumber
title Data Collection AF and service provider call flows (AF providing interfaces)

box rgb(255,255,220) User Equipment
participant UE as Direct Data<br/>Reporting Client
end
box rgb(220,255,220) Data Collection
participant AF as Application Function
participant SP as Data Collection library
end
box rgb(220,220,255) 5G Core
participant NRF as Network Registration Function
end
box rgb(255,220,220) 3rd Party Systems
participant AP as Application Provider
end

%% == Start-up ==
note over UE,AP: Start-up
AF ->> SP: Initialise library:<br/>Register known data<br/>reports and event types
SP -->> AF: Library initialised:<br/>True or False
AF ->> SP: Register NF services:<br/>Add library handled services<br/>to NF instance description
SP -->> AF: OK
AF ->> NRF: Register NF Instance
NRF -->> AF: Instance registered
%% == Provisioning ==
note over UE,AP: Provisioning
AP ->> AF: Create Provisioning Session
AF -->> AP: Provisioning session creation success/failure
AP ->> AF: Create Data Reporting Configuration for the provisioning session:<br/>Includes configuration for sampling, reporting and filtering/aggregation for event exposure
AF -->> AF: Validate the reporting configuration
break validation failed
AF -->> AP: Error: ProblemDetail indicates the cause of the error
end
opt First time reporting is configured
loop For each event type the AF handles
AF ->> SP: (C API)<br/>Create provisioning session:<br/>Provide the external_app_id and event type
SP -->> AF: (C API)<br/>Provisioning session creation result
AF -->> AF: Remember the created provisioning session
end
end
AF ->> SP: (C API)<br/>Add configuration to provisioning session
SP -->> AF: (C API)<br/>Configuration addition result
break configuration failed
AF -->> AP: Error: ProblemDetail indicates the cause of the error
end
AF -->> AP: Configuration added to the provisioning session

%% == Event Subscription ==
note over UE,AP: Event Subscription
AP ->> AF: Register for events
AF ->> AF: Validate event subscription
break validation failed
AF -->> AP: Error: Reason for error in ProblemDetail
end
AF ->> SP: (C API)<br/>Create event exposure subscription
SP -->> AF: (C API)<br/>Event exposure subscription result
break subscription failed
AF -->> AP: Error: Reason for error in ProblemDetail
end
AF -->> AP: OK: event subscription id in Location header

%% == Data Reporting ==
note over UE,AP: Data Reporting
UE ->> AF: Create Application Session
AF ->> AF: Validate Application Session
break validation failed
AF -->> UE: Error: Reason for error in ProblemDetail
end
AF -->> UE: Application Session created<br/>Location header contains the session id<br/>Reporting parameters in body

loop Operations according to rules in Application Session response
  alt Report Metrics Data
    UE ->> AF: Report data
    AF -->> AF: Parse and validate report
    break on error
      AF -->> UE: Error: Reason for error in body
    end
    opt First report from this UE client
      AF ->> SP: (C API)<br/>Create data reporting session
      SP -->> AF: (C API)<br/>Data reporting session result
      break session failed
        AF -->> UE: Error: Body indicates failure to record metrics
      end
      AF -->> AF: Store the data reporting<br/>session in the application session
    end
    AF ->> SP: (C API)<br/>Store data report samples
    SP -->> SP: report samples added to database
    SP -->> AF: (C API)<br/>Storage result
    break on error
      AF -->> UE: Error: Failed to store metrics
    end
    AF -->> UE: OK: Metrics stored
    opt If there is a subscription to an event that uses this report type
        SP ->> AF: (C API)<br/>Generate event notifications<br/>for event subscription
        AF ->> SP: (C API)<br/>Get bucketed reports: passes some filtering information
        SP -->> SP: collect samples from database
        SP -->> SP: bucket samples for aggregation
        opt if sample needs apportioning for the bucket
            SP ->> AF: (C API - callback)<br/>Proportion record
            AF -->> SP: (C API - callback)<br/>Proportioned record
        end
        SP ->> AF: (C API - callback) Aggregate samples for each bucket
        AF ->> SP: (C API)<br/>Apply aggregation to sample values
        SP -->> AF: (C API)<br/>Aggregated result
        AF -->> AF: Create new data sample record with aggregated results
        AF -->> SP: (C API - callback) Aggregated sample(s)
        SP -->> AF: (C API) Return bucketed aggregated samples
        AF -->> AF: Convert bucketed samples into event exposure notifications
        AF -->> SP: (C API) Return generated event notifications
        SP ->> AP: Send event notifications
    end
  else Refresh Application Session
    UE ->> AF: Retrieve Application Session
    AF -->> UE: OK: Updated Application session in body
  end
end

%% == End Data Reporting ==
note over UE,AP: End Data Reporting
UE ->> AF: Destroy Application Session
AF -->> UE: 204 No Content
%% == End Event Subscription ==
note over UE,AP: End Event Subscription
AP ->> AF: Destroy Event Subscription
AF -->> AP: 204 No Content
%% == End Data Reporting Provisioning Session ==
note over UE,AP: End Provisioning Session
AP ->> AF: Destroy Provisioning Session
AF -->> AP: 204 No Content
