docs/Data-Collection-AF.md
```plantuml
autonumber
title Data Collection AF and service provider call flows (AF providing interfaces)

participant "Direct Data\nReporting Client" as UE
participant "Application Function" as AF
participant "Data Collection library" as SP
participant "Network Registration Function" as NRF
participant "Application Provider" as AP

== Start-up ==
AF -> SP: Initialise library:\nRegister known data\nreports and event types
SP --> AF: Library initialised:\nTrue or False
AF -> SP: Register NF services:\nAdd library handled services\nto NF instance description
SP --> AF: OK
AF -> NRF: Register NF Instance
NRF --> AF: Instance registered

== Provisioning ==
AP -> AF: Create Provisioning Session
AF --> AP: Provisioning session creation success/failure
AP -> AF: Create Data Reporting Configuration for the provisioning session:\nIncludes configuration for sampling, reporting and filtering/aggregation for event exposure
AF --> AF: Validate the reporting configuration
break validation failed
AF --> AP: Error: ProblemDetail indicates the cause of the error
end
opt First time reporting is configured
loop For each event type the AF handles
AF -> SP: (C API)\nCreate provisioning session:\nProvide the external_app_id and event type
SP --> AF: (C API)\nProvisioning session creation result
AF --> AF: Remember the created provisioning session
end
end
AF -> SP: (C API)\nAdd configuration to provisioning session
SP --> AF: (C API)\nConfiguration addition result
break configuration failed
AF --> AP: Error: ProblemDetail indicates the cause of the error
end
AF --> AP: Configuration added to the provisioning session

== Event Subscription ==
AP -> AF: Register for events
AF -> AF: Validate event subscription
break validation failed
AF --> AP: Error: Reason for error in ProblemDetail
end
AF -> SP: (C API)\nCreate event exposure subscription
SP --> AF: (C API)\nEvent exposure subscription result
break subscription failed
AF --> AP: Error: Reason for error in ProblemDetail
end
AF --> AP: OK: event subscription id in Location header

== Data Reporting ==
UE -> AF: Create Application Session
AF -> AF: Validate Application Session
break validation failed
AF --> UE: Error: Reason for error in ProblemDetail
end
AF --> UE: Application Session created\nLocation header contains the session id\nReporting parameters in body

loop Operations according to rules in Application Session response
  alt Report Metrics Data
    UE -> AF: Report data
    AF --> AF: Parse and validate report
    break on error
      AF --> UE: Error: Reason for error in body
    end
    opt First report from this UE client
      AF -> SP: (C API)\nCreate data reporting session
      SP --> AF: (C API)\nData reporting session result
      break session failed
        AF --> UE: Error: Body indicates failure to record metrics
      end
      AF --> AF: Store the data reporting\nsession in the application session
    end
    AF -> SP: (C API)\nStore data report samples
    SP --> SP: report samples added to database
    SP --> AF: (C API)\nStorage result
    break on error
      AF --> UE: Error: Failed to store metrics
    end
    AF --> UE: OK: Metrics stored
    opt If there is a subscription to an event that uses this report type
        SP -> AF: (C API)\nGenerate event notifications\nfor event subscription
        AF -> SP: (C API)\nGet bucketed reports: passes some filtering information
        SP --> SP: collect samples from database
        SP --> SP: bucket samples for aggregation
        opt if sample needs apportioning for the bucket
            SP -> AF: (C API - callback)\nProportion record
            AF --> SP: (C API - callback)\nProportioned record
        end
        SP -> AF: (C API - callback) Aggregate samples for each bucket
        AF -> SP: (C API)\nApply aggregation to sample values
        SP --> AF: (C API)\nAggregated result
        AF --> AF: Create new data sample record with aggregated results
        AF --> SP: (C API - callback) Aggregated sample(s)
        SP --> AF: (C API) Return bucketed aggregated samples
        AF --> AF: Convert bucketed samples into event exposure notifications
        AF --> SP: (C API) Return generated event notifications
        SP -> AP: Send event notifications
    end
  else Refresh Application Session
    UE -> AF: Retrieve Application Session
    AF --> UE: OK: Updated Application session in body
  end
end

== End Data Reporting ==
UE -> AF: Destroy Application Session
AF --> UE: 204 No Content

== End Event Subscription ==
AP -> AF: Destroy Event Subscription
AF --> AP: 204 No Content

== End Data Reporting Provisioning Session ==
AP -> AF: Destroy Provisioning Session
AF --> AP: 204 No Content
```
